__author__ = "smafjal"
__email__ = "afjal.sm19@gmail.com"
__date__ = "2/17/21-15:16"


def get_topics():
    topics = ['ব্যক্তিত্ত্ব',
              'স্বাস্থ্য ও চিকিৎসা',
              'তথ্যপ্রযুক্তি',
              'খেলা',
              'অপরাধ',
              'আইন ও বিচার',
              'শিক্ষা',
              'রাজনীতি',
              'সংবাদ',
              'সরকার',
              'বিজ্ঞান',
              'জনগণ',
              'ধর্ম',
              'সোশ্যাল মিডিয়া',
              'লাইফ স্টাইল',
              'বিনোদন',
              'কেনা-কাটা',
              'অর্থনীতি',
              'বাণিজ্য',
              'পণ্য',
              'খাবারদাবার ও রান্না',
              'পরিবহন ব্যবস্থা',
              'ইতিহাস',
              'দুর্ঘটনা',
              'পরিবেশ',
              'টেলিযোগাযোগ',
              'দৈনন্দিন জীবন',
              'শিল্প ও সাহিত্য',
              'বাজেট',
              'নির্বাচন',
              'সমাজকল্যাণ',
              'সংস্কৃতি',
              'উৎসব',
              'বিরোধী দল',
              'কৃষি',
              'ভ্রমণ',
              'মুক্তিযুদ্ধ',
              'কূটনীতি',
              'প্রবাসী',
              'সম্পর্ক',
              'প্রাণিসম্পদ',
              'সামরিক',
              'শেয়ারবাজার',
              'আবেগ',
              'গার্মেন্টস',
              'আন্তর্জাতিক',
              'ভূমি',
              'ভাষা',
              'প্রাকৃতিক সম্পদ',
              'সোশ্যাল মিডিয়া',
              'পরিবার',
              'চাকরি',
              'সেবা',
              'বাংলাদেশ',
              'দেশপ্রেম',
              'সমাজ ব্যবস্থা']
    return topics


def get_hypothesis():
    common_hypo1 = "এখানে আলোচনা করা হইয়াছে {} নিয়ে"
    common_hypo2 = "আলোচিত বিবরনে {} নিয়া কথা বলা হয়েছে ।"
    topics = get_topics()

    hypothesis = {}
    for t in topics:
        hypothesis[t] = [
            common_hypo1.format(t),
            common_hypo2.format(t)
        ]
    return hypothesis
